AuditLogs
| where TimeGenerated between(datetime("01-07-2022 09:00:00") .. datetime("01-07-2022 09:00:00"))
| extend userPrincipalName = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| where userPrincipalName == "[enter user here]"
| sort by TimeGenerated asc
| project TimeGenerated, userPrincipalName, OperationName, ResultDescription
