AuditLogs
| where TimeGenerated > ago(1d)
| where OperationName == "Add member to role completed (PIM activation)"
| extend AccountUPN = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| where AccountUPN in ("", "")
| project TimeGenerated, AccountUPN, ResultDescription
| summarize count() by TimeGenerated, AccountUPN, ResultDescription
| sort by AccountUPN asc
