// Check if a user is Legacy Authentication. 
let UserNames = dynamic([""]);
SigninLogs
| where UserPrincipalName in (UserNames)
| where ClientAppUsed in (
    "Exchange ActiveSync", "Exchange Web Services", "AutoDiscover", "Unknown", "POP3", "IMAP4", "Other clients", "Authenticated SMTP", "MAPI Over HTTP", "Offline Address Book"
    )
| extend
    ConditionalAccessResult = 
        iff(ConditionalAccessPolicies[0].displayName == "Block Basic Auth", ConditionalAccessPolicies[0].result
        , iff(ConditionalAccessPolicies[1].displayName == "Block Basic Auth", ConditionalAccessPolicies[1].result
        , iff(ConditionalAccessPolicies[2].displayName == "Block Basic Auth", ConditionalAccessPolicies[2].result
        , iff(ConditionalAccessPolicies[3].displayName == "Block Basic Auth", ConditionalAccessPolicies[3].result
        , iff(ConditionalAccessPolicies[4].displayName == "Block Basic Auth", ConditionalAccessPolicies[4].result
        , '')))))
| extend LocationString = strcat(tostring(LocationDetails.countryOrRegion), "/", tostring(LocationDetails.state), "/", tostring(LocationDetails.city))
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), LocationCount=dcount(LocationString), Location = make_set(LocationString),
  IPAddress = make_set(IPAddress), IPAddressCount = dcount(IPAddress),
  SigninCount = count()
  by UserPrincipalName, Type
