OfficeActivity
| where TimeGenerated between(datetime("01-17-2022 08:00:00") .. datetime("01-17-2022 11:00:00"))
| where UserId == ""
| where Operation == "MemberAdded"
| project TimeGenerated, RecordType, Operation, UserId, ClientIP, Members, TeamName, ItemName
