SigninLogs
| where TimeGenerated between(datetime("02-07-2022 09:00:00") .. datetime("02-07-2022 09:00:00"))
| where UserPrincipalName == ""
| project TimeGenerated, IPAddress, Location, LocationDetails, OperationName, ResourceDisplayName, AppDisplayName, Status
| sort by TimeGenerated
